[{
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/8516/attachments/original/1494520410/Miriam_Brett.jpg?1494520410",
	"page": "https://www.snp.org/miriam_brett",
	"name": "Miriam Brett",
	"constituency": "Orkney and Shetland",
	"intro": ["Miriam is a 25 year old Shetlander, was born and bred in the isles, living between Bressay and Waas. After graduating with a degree in international politics, Miriam worked in progressive policy research, before taking up the post as the Senior Economic Advisor to the SNP Westminster Group.", "\"It was a privilege to grow up in such a unique and beautiful community, and I cannot think of a greater honour than representing my home constituency in parliament.", "People across these isles have needlessly been subjected to harmful, counterproductive cuts under both the Liberal Democrat - Conservative coalition and the current UK Government. We need only to look at the food bank usage across these isles to see the damage that this has caused. The SNP is the only opposition to have consistently voted against austerity, and I will use my voice at Westminster to unapologetically reject these cuts.", "The harsh realities of a hard Tory Brexit pose a very real threat to our communities, from the need to protect EU citizens living in our isles, to the need to ensure that local businesses do not face hardship. The SNP has demonstrated time and time again that we are an effective opposition to the Tories, and will continue to ensure that communities across Scotland have their voice heard.", "If elected, I promise to represent the issues facing our community in Westminster, and to work tirelessly to serve every one of my constituents.\""],
	"contacts": {
		"facebook": "MiriamBrettSNP/",
		"twitter": "MiriamBrett"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/982/attachments/original/1494587207/jim_eadie.jpg?1494587207",
	"page": "https://www.snp.org/jim_eadie",
	"name": "Jim Eadie",
	"constituency": "Edinburgh South",
	"intro": ["Jim Eadie's campaigning successes include the first ever All Party UK Warm Homes Group to campaign against fuel poverty, influencing legislation on behalf of the nursing profession and securing millions of pounds of funding for life sciences in Scotland.", "He was the Head of medicines industry trade body ABPI Scotland for 5 years until 2007, representing a sector worth 300 million pounds to the Scottish Economy.", "He has previously worked for the Royal College of Nursing in the constituency and for Scottish Television at Westminster. In 2008 Jim has ran his own consulting business working for clients in the corporate and voluntary sectors before he was elected as an MSP for Edinburgh Southern in May 2011.", "Jim was selected to be the SNP's candidate for the 2017 General Election in Edinburgh South."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/3061/attachments/original/1456307723/Toni.jpg?1456307723",
	"page": "https://www.snp.org/toni_giugliano",
	"name": "Toni Giugliano",
	"constituency": "Edinburgh West",
	"intro": ["Toni works in the third sector for one of Scotland's leading mental health charities. He was born in Italy and moved to Scotland with his family aged seven. He grew up in the West of Scotland before moving to Edinburgh where he graduated in European politics and French with EU constitutional law from the University of Edinburgh.", "Toni became involved in politics through the European Movement where he campaigned for EU reform and for Scotland's direct place in Europe. He has worked for a number EU organisations in Brussels, including the European University Association, where he represented the interests of 850 universities across Europe and successfully led a campaign that halted a 500 million Euro cut to research funding.", "In Scotland, he has worked for NHS Health Scotland and as a caseworker in the Scottish Parliament, where he assisted constituents from Edinburgh Western on a wide range of local issues for over four years.", "Campaign Office: 183 St John's Road, Corstorphine", "toni.giugliano@edinburghsnp.orgFacebookTwitter"],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/8514/attachments/original/1494418517/David_Linden.jpg?1494418517",
	"page": "https://www.snp.org/david_linden",
	"name": "David Linden",
	"constituency": "Glasgow East",
	"intro": ["Originally from Cranhill, before moving to Garrowhill with his family, David Linden is an East End lad and has been an SNP activist for 16 years.", "He went to Milncroft Primary School (now demolished and replaced by Cranhill Primary), Garrowhill Primary School and then Bannerman High School in Baillieston.", "He spent his early working life in the finance sector within the underwriting team at Access Loans & Mortgages, then undertook a qualification in Business Administration, which he completed during his years at Glasgow Credit Union.", "Following the SNP’s historic Glasgow East by-election victory in 2008, David worked as a caseworker in the Glasgow East constituency office, where he assisted hundreds of local people and built up strong relationships with community groups & leaders as well as local businesses.", "Since then, David has had experience of working in Holyrood, Brussels and Westminster for the SNP, where he has helped develop campaigns, undertook policy research, devise media strategy and assist in local constituency casework. He currently runs the office of Alison Thewliss, SNP MP for Glasgow Central and SNP spokesperson for Cities in Westminster.", "David is a former branch organiser of Shettleston SNP and was the campaign manager for the successful Yes Shettleston campaign during the independence referendum.", "He is married to a Primary Teacher with one young son, Isaac. In his spare time, David enjoys combining his interest in running and fundraising for good causes, which he recently did by raising over £3,000 for Glasgow Rape Crisis Centre, taking part in the Great Scottish Run."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/8510/attachments/original/1494237271/mairi_mcallan.jpg?1494237271",
	"page": "https://www.snp.org/mairi_mcallan",
	"name": "Mairi McAllan",
	"constituency": "Dumfriesshire, Clydesdale and Tweeddale",
	"intro": ["Mairi was brought up in Biggar and attended school there before earning her degree in Scots law from Glasgow University. During this time, Mairi also lived in Belgium studying various aspects of European law at the University of Ghent.Thereafter she worked in politics before returning to education to complete her Diploma in Professional Legal Practice for which she received merit and the Law Society of Scotland award in Human Rights. She is a trainee commercial solicitor and when not working, helps her partner, Iain run his beef and sheep farm in the Crawick Valley near Sanquhar, Dumfriesshire where they live. Mairi is also a singer and when time permits, she plays in a folk band. An active community campaigner and a passionate advocate for this part of rural Scotland, Mairi stood for the SNP on the South of Scotland regional list in the 2016 Scottish Parliamentary Election. Mairi is determined to play her part in safeguarding Scotland from what she sees as the long term economic and social dislocation promised by Theresa May’s hard Brexit and the chilling prospect of an unfettered Tory government hellbent on further austerity. She believes that in Scotland, only the SNP can provide an effective opposition to this. ", "\"‘I’m offering the people of Dumfriesshire, Clydesdale and Tweeddale a strong voice and a clear choice. ", "A choice between a future in which I ensure their voices are heard loud and clear in Westminster, and one where crucial decisions are made, behind closed doors, by a Tory government with its own dangerous agenda.This is a wonderful part of Scotland and I love living here. I would relish the opportunity to help our home reach its true potential and look forward to meeting as many people as possible on the campaign trail, over the next few weeks.\""],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/3163/attachments/original/1494587443/Eilidh_Whiteford.jpg?1494587443",
	"page": "https://www.snp.org/eilidh_whiteford_about",
	"name": "Eilidh Whiteford",
	"constituency": "Banff and Buchan",
	"intro": ["Eilidh Whiteford was born in 1969 in Aberdeen and grew up in Macduff, Banffshire, where her parents still live. She went to Banff Academy. She has been active in the SNP since joining her local branch in 1986 during the run up to Alex Salmond's victorious 1987 election. She later served in the Peterhead office working for Alex Salmond in 1992.", "At Glasgow University she quickly got involved with the Federation of Student Nationalists, first as National Organiser and then as President, sitting on the SNP National Executive and acting as party spokesperson on Higher Education.", "In between the politics, she graduated with First Class Honours in English and Scottish Literature, followed by postgraduate studies in Canada and Scotland that led to a PhD in 1998.", "She returned to the North East in early 1998 to work for Allan Macartney MEP. Following Macartney's passing in 1998, she worked for Ian Hudghton MEP until the 1999 elections, and later helped new MSP Irene McGugan establish a constituency office in the first term of the Scottish Parliament.", "She returned to Glasgow University in 1999 to teach, lecturing in Scottish Literature and developing access routes into higher education for mature students (in Glasgow University's adult and continuing education department).", "In 2001, she moved into a campaigning role in the voluntary sector as Co-ordinator of the Scottish Carers' Alliance, a network of carer, disability and children's organisations working for the rights of and to support people looking after elderly, sick or disabled relatives or friends at home.", "In 2003 she moved to Oxfam where she worked as a policy adviser and campaigns manager for over six years in a role that took her to many parts of the world. Closer to home, Whiteford was very actively involved in the Make Poverty History campaign in 2005 and helped establish the Scottish Fair Trade Forum. She also promoted development issues with members of the Scottish Parliament, and immediately after the Make Poverty History campaign, became Oxfam's Scottish Campaigns Manager.", "First elected in 2010, she was re-elected as part of the SNP’s #team56 in 2015, and is now the SNP Westminster Group Secretary, and the Shadow Group Leader on Social Justice. "],
	"contacts": {
		"telephone": "1779822022 eilidh.whiteford.mp@parliament.uk",
		"email": "https://www.facebook.com/DrEilidhWhiteford",
		"twitter": "EilidhWhiteford",
		"website": "http://eilidhwhiteford.info/"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/966/attachments/original/1494587229/Pete_wishart.jpg?1494587229",
	"page": "https://www.snp.org/pete_wishart",
	"name": "Pete Wishart",
	"constituency": "Perth & North Perthshire",
	"intro": ["Pete was the Member of Parliament for Perth and North Perthshire and was previously the MP for North Tayside from 2001-2005. ", "The Perth and North Perthshire seat was created after the 2005 Westminster boundary changes in Scotland and takes in East and Highland Perthshire, the City of Perth and the Carse of Gowrie. Pete held the seat with a majority of 9,641 over the Conservatives, 50.5% of the vote in the 2015 General Election. ", "Pete has constituency offices in Perth and Blairgowrie and he consistently ranks as one of Westminster’s hardest working MPs. ", "Born in Dunfermline in 1962, Pete was educated at Queen Anne High School and Moray House College, Edinburgh. He lives in Perth, has one son and enjoys walking in the Perthshire hills. ", "Pete is the SNP’s Shadow Leader of the House of Commons and the Chair of the Scottish Affairs Committee. He is also Chair of the All Party Parliamentary Group (APPG) on Intellectual Property and the Writers’ APPG. Pete is also the Vice Chair of the APPG on Haemophilia and Infected Blood and the APPGs on Music, Beer and the Performers’ Alliance. ", "Prior to being elected Pete spent 15 years in the music business, first as a founder member of the Scottish rock group, Big Country, then with iconic Scottish group, Runrig. Pete has sold over 1 million records worldwide and is the only MP to have appeared on Top of the Pops. ", "Pete is a trained Community Worker and has worked with many voluntary agencies and charities throughout Scotland. Pete is a columnist for the Scots Independent newspaper, blogger and regularly contributes to a variety of political forums. In 2014 he won an award for his contributions on social media. ", "Pete currently plays with the cross party rock band, MP4, raising money for good causes."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/965/attachments/original/1495702792/Corri_Wilson.jpg?1495702792",
	"page": "https://www.snp.org/corri_wilson",
	"name": "Corri Wilson",
	"constituency": "Ayr, Carrick & Cumnock",
	"intro": ["Corri Wilson has represented the constituency of Ayr, Carrick and Cumnock, since her election in May 2015. ", "She became the SNP's Disabilities Spokesperson in 2016.", "Born in Ayr, Corri has lived and worked throughout the constituency all her life. She has two grown‐up children and, before her election, Corri served as a councillor for the Ayr East ward of South Ayrshire Council. ", "Educated locally, Corri joined the Civil Service on leaving school and worked her way up to management level. After 20 years, growing disillusioned with the policy changes being brought in by the Westminster Government, she left the Civil Service to study psychology before working in the voluntary sector and then running her own event management and business support company. ", "Throughout her working life, Corri has always been an active member of her community and has worked to ensure she could make a positive contribution, from school boards to youth work, and from working as a Police Custody Welfare Officer to sitting on her local Community Council and being a member of the NHS Partnership Forum for health and cancer care services. In addition, Corri is has served as a Director of Septembayr [The Ayrshire Festival], Ayrshire Housing and Ayr Renaissance. ", "Corri's main political interests are Scottish independence, welfare and social justice, rural issues and connectivity, tourism, youth issues, disability rights and people trafficking. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/964/attachments/original/1442493551/Whitford_Philippa_MP.jpg?1442493551",
	"page": "https://www.snp.org/philippa_whitford",
	"name": "Philippa Whitford",
	"constituency": "Central Ayrshire",
	"intro": ["Originally from Belfast, Philippa trained mostly around the West of Scotland. She spent two years working as a medical volunteer in the Middle East. Most of this time was based at a UN sponsored hospital in Gaza, Palestine with a few months in Lebanon planning development projects after the war. Philippa’s interest and involvement in patients with breast cancer developed early in her career and her Doctorate research was on Breast Cancer Immunology and monoclonal antibodies.", "She was a consultant breast surgeon for just over 15 years in Ayrshire and Arran and during that time had been Lead Clinician for that health board and was Lead Clinician of the West of Scotland MCN from 2006 to 2009.", "Philippa was involved in the first SIGN guidelines for breast cancer and chaired the breast cancer project groups of the Clinical Standards Board for Scotland and, later, NHS QIS. Her special interest has been in improving services through peer reviewed audit, service redesign and the development of clinical standards.", "Elected in May 2015, she was the Member of Parliament for Central Ayrshire and sat on the Health Select Committee. Philippa is the Shadow SNP Westminster Group Leader (Health). "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/963/attachments/original/1442493430/Weir_Mike_MP.jpg?1442493430",
	"page": "https://www.snp.org/mike_weir",
	"name": "Mike Weir",
	"constituency": "Angus",
	"intro": ["Mike Weir was born and brought up in Arbroath. After graduating in law from Aberdeen University Mike served in legal apprenticeship in Montrose and worked as a solicitor in Kirkcaldy, Montrose and Brechin, where he was a partner in the local firm of J&DG Shiell. ", "He was first elected to Westminster for the old Angus seat in 2001. He was elected to the substantially re drawn Angus seat in 2005, tripling his notional majority. In 2010 he was re-elected, doubling his majority, and again in 2015.", "Mike has served on the Scottish Affairs, Trade and Industry and Energy and Climate Change Select Committees. He is also a member of the Chairmans Panel, in which capacity he chairs debates and standing committees.", "He has held many posts within the SNP and is currently Chief Whip. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/1030/attachments/original/1494583580/Owen_Thompson.jpg?1494583580",
	"page": "https://www.snp.org/owen_thompson",
	"name": "Owen Thompson",
	"constituency": "Midlothian",
	"intro": ["Owen was raised in Loanhead after moving there aged 7 when his dad became minister at Loanhead Parish Church. After attending Beeslack High School in Penicuik, Owen studied Accounting and Finance at Napier University. After working in the financial Services industry for a period Owen was elected to Midlothian Council in November 2005 at the Loanhead by-election. At this time Owen was the youngest Councillor in Scotland. ", "Owen started on the campaign trail early having delivered his first leaflets aged 8. He was successfully re-elected in both 2007 and 2012 becoming Leader of Midlothian Council in 2013. ", "Owen enjoys football, rugby, craft beer, and films. "],
	"contacts": {
		"address": "97 High Street, Dalkeith",
		"telephone": "0131 663 9675",
		"email": "owen.thompson.mp@parliament.uk",
		"facebook": "owen4mid",
		"twitter": "owenthompson",
		"website": "http://owenthompson.scot"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/961/attachments/original/1494521878/Alison_thewliss.jpg?1494521878",
	"page": "https://www.snp.org/alison_thewliss",
	"name": "Alison Thewliss",
	"constituency": "Glasgow Central",
	"intro": ["Alison Thewliss was elected to serve the people of Glasgow Central in May 2015. She is the SNP Spokesperson for Cities in the House of Commons.", "Prior to her election as an MP, she served as Glasgow Councillor for the Calton Ward in the East End. Alison was the Glasgow SNP Council Group's spokesperson on Land and Environmental Services, and she takes a keen interest in improving local government and democracy. She is a member of Scottish CND and believes passionately in the scrapping of nuclear weapons. ", "Alison lives in Glasgow with her husband and 2 young children. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/960/attachments/original/1494522114/Chris_stephens.jpg?1494522114",
	"page": "https://www.snp.org/chris_stephens",
	"name": "Chris Stephens",
	"constituency": "Glasgow South West",
	"intro": ["Chris Stephens, born in Glasgow March 1973, is employed by Glasgow City Council, and is a Senior UNISON activist in the city, acting as a lead negotiator, and having represented trade union members on issues such as disability and racial discrimination, occupational pension protection, and on equal pay matters.", "Chris is a member of the party’s National Executive Committee, Convener of Glasgow Pollok Constituency Association, and Secretary of the SNP Trade Union Group, assisting in building the Party’s profile in the Trade Union Movement.", "Chris is a proud Partick Thistle supporter and regularly attends matches.", "Among Chris’s pledges is to support people and local communities, campaign for humane welfare measures, and to provide access to advice and food security by holding welfare surgeries."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/959/attachments/original/1442492659/Sheppard_Tommy_MP.jpg?1442492659",
	"page": "https://www.snp.org/tommy_sheppard",
	"name": "Tommy Sheppard ",
	"constituency": "Edinburgh East",
	"intro": ["Born and bred on the north coast of Ireland, Tommy went to Aberdeen University to study medicine in 1977. He graduated in 1982 with a degree in sociology and politics. He set off for London having been elected Vice-President of the NUS, intending to stay for a year. He stayed for eleven, working in PR and campaigns along the way. He was elected to Hackney Council in 1986 and became deputy leader four years later.", "In 1993 he returned to Scotland and was appointed Assistant General Secretary of the Labour Party under John Smith. Three years later Tony Blair asked him to leave. He started the Stand Comedy Club as a hobby in 1995 and in 1998 turned it into a business. It is now a successful institution with venues in Edinburgh, Glasgow and Newcastle. It is also one of the largest venues on the Edinburgh Fringe, the world’s largest arts festival.", "Tommy was very active in the Yes campaign in the two years running up to the referendum. He ran the local group in south Edinburgh and helped nationally too – he organised the Night for Scotland event at the Usher hall four days before the vote. ", "He is on the National Council of the Scottish Independence Convention and the board of Common Weal. A new member of the SNP he was elected as MP in the Edinburgh East constituency at the 2015 General Election. He lives in Newington with his partner Kate and cocker spaniel Henry."],
	"contacts": {
		"facebook": "TommySheppardSNP/",
		"twitter": "tommysheppard",
		"website": "http://www.tommysheppardmp.scot"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/958/attachments/original/1494522226/Alex_Salmond.jpg?1494522226",
	"page": "https://www.snp.org/alex_salmond",
	"name": "Alex Salmond",
	"constituency": "Gordon",
	"intro": ["Alex Salmond was born in Linlithgow in 1954. He attended Linlithgow Academy before studying at St Andrew's University, where he graduated with a joint honours MA in Economics and History.", "In 1978 he joined the Government Economic Service as an Assistant Economist in the Department of Agriculture and Fisheries for Scotland. In 1980 he joined the Royal Bank of Scotland where he worked for seven years: first as an Assistant Economist before being appointed Oil Economist in 1982, and from 1984 combining that role with duties as a bank economist. He has also been a visiting professor of economics at Strathclyde University.", "He was first elected as MP for Banff & Buchan in 1987 and was elected as National Convener for the Scottish National Party in 1990. He served as leader of the opposition in the Scottish Parliament when he was elected MSP for Banff & Buchan constituency in 1999. He stood down as SNP National Convener in 2000 and left the Scottish Parliament in 2001.", "He was re-elected as Leader of the SNP in 2004 and elected as MSP for the Gordon constituency in May 2007.He made political history after becoming the first nationalist to be elected First Minister of Scotland on 16 May 2007. He stepped down in November 2014. He was elected as MP for Gordon in the 2015 General Election.", "He and his wife Moira married in 1981 and live in Strichen in Aberdeenshire. When not working he enjoys horse racing, football - supporting Scotland and Heart of Midlothian FC - golf and reading. "],
	"contacts": {
		"facebook": "AlexSalmond",
		"twitter": "alexsalmond",
		"email": "http://www.twitter.com/alexsalmond",
		"website": "http://www.alexsalmond.scot/"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/957/attachments/original/1494522302/Angus_Robertson.jpg?1494522302",
	"page": "https://www.snp.org/angus_robertson",
	"name": "Angus Robertson",
	"constituency": "Moray",
	"intro": ["Angus Robertson MP is the Depute Leader of the SNP and leader at Westminster. ", "Before his election in June 2001 he was the European and International Affairs Adviser to the SNP group in the Scottish Parliament. ", "Prior to that, he worked as a foreign and diplomatic correspondent in central Europe for the BBC, Austrian Radio and other leading broadcasters.", "Angus was born in London and brought up in Edinburgh where he received both his Primary and High School education. After leaving Broughton High School Angus completed a MA Honours in Politics and International Relations at Aberdeen University before embarking on his journalistic career.", "Angus' main political interests are Scottish independence, International and European Affairs, defence, whisky, oil, fishing, sustainable development and youth issues."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/956/attachments/original/1442437046/Paterson_Steven_MP.jpg?1442437046",
	"page": "https://www.snp.org/steven_paterson",
	"name": "Steven Paterson",
	"constituency": "Stirling",
	"intro": ["Steven stepped down from Stirling Council in 2015 after winning in the General Election and becoming the Stirling constituency’s first ever SNP MP. Prior to that, he had served as Councillor for the Stirling East ward since 2007.", "Now, as a Member of Parliament, Steven is a member of several All Party Parliamentary Groups (including serving as the Chair for the Wood Panel APPG and Vice-Chair of the Campaign for Nuclear Disarmament APPG). He is also on the SNP Westminster Group’s Defence Team, working with Brendan O’Hara MP.", "On being elected in May 2015, Steven said: “I'm extremely honoured to have been elected to represent my home constituency. We need an opposition who will stand up for the Stirling area and fight the Tory Government’s cuts agenda, not support it like Labour does.”"],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/955/attachments/original/1442436945/Oswald_Kirsten_MP.jpg?1442436945",
	"page": "https://www.snp.org/kirsten_oswald",
	"name": "Kirsten Oswald",
	"constituency": "East Renfrewshire",
	"intro": ["Kirsten Oswald is a senior Human Resources professional, working in the Further Education sector. Her professional interests include employee engagement, and equalities.", "Kirsten was born in Dundee, and grew up in Carnoustie, attending Carlogie Primary and Carnoustie High Schools. She has a degree in History from the University of Glasgow. She moved to East Renfrewshire in 2008, and lives in Clarkson with her husband and two sons.", "A relatively new SNP member, Kirsten joined in June 2014, and is a member of the Eastwood branch. Kirsten was an active Yes campaigner, and on the committee of her local Women for Independence group, where she was responsible for foodbank collections. She is very involved in community work, as a community councillor, parent councillor, and with a range of other local groups. Kirsten runs community social media sites, and in her spare time is a keen sports fan. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/954/attachments/original/1494522400/brendan_o'hara.jpg?1494522400",
	"page": "https://www.snp.org/brendan_o_hara",
	"name": "Brendan O'Hara",
	"constituency": "Argyll & Bute",
	"intro": ["Brendan O’Hara is 51 years old and lives in Helensburgh with his wife and two daughters. Originally from Glasgow, he has lived in Argyll and Bute since 2004.", "Educated at St. Andrew’s secondary school in Carntyne, Brendan worked with Glasgow District Council for a few years before attending Strathclyde University, from where he graduated in 1992 with a 2:1 in Economic History and Modern History.", "He has twice before represented the SNP at a General Election; in Springburn in 1987 and again in Glasgow Central in 1992 Brendan is an independent, award­winning television producer and has worked for STV, SKY SPORTS and the BBC. Among his credits are Comedy Connections and Movie Connections (BBC1), The Football Years (STV), Scotland’s Greatest Album (STV), Road To Referendum (STV) and he is currently working on the second series of David Hayman’s very successful series following in the footsteps of Tom Weir. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/953/attachments/original/1494582824/John_Nicolson.jpg?1494582824",
	"page": "https://www.snp.org/john_nicolson",
	"name": "John Nicolson ",
	"constituency": "East Dunbartonshire",
	"intro": ["John Nicolson was born in Glasgow. He studied at Glasgow University where he was the Scottish and World Student debating champion. He graduated with an honours MA, winning a Kennedy Scholarship and Harkness Fellowship to Harvard.", "He was subsequently recruited by Senator Moynihan of New York as a speechwriter on Capitol Hill. John returned to Glasgow to present ‘Open to Question’ for BBC Scotland, before joining ‘On the Record’ in London as a political correspondent. He went on to report for some of the BBC’s most high profile programmes including ‘Newsnight’, ‘Panorama’, and ‘Public Eye’.", "He was the main presenter of BBC Breakfast for a number of years. Actively involved in the referendum campaign, John returned to Glasgow University to debate independence with other former World Debating Champions for STV.", "He was a member of the National Collective. He recently hosted Nicola Sturgeon’s tour of Scotland including the Glasgow Hydro event. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/952/attachments/original/1442436534/Newlands_Gavin_MP.jpg?1442436534",
	"page": "https://www.snp.org/gavin_newlands",
	"name": "Gavin Newlands",
	"constituency": "Paisley & Renfrewshire North",
	"intro": ["Gavin was born in the old Paisley Maternity Hospital in 1980 and was raised in the town of Renfrew, where he currently lives with his wife, Lynn, and their two children. He was educated at Renfrew’s St James’ Primary and Trinity High School in the town.", "While enrolled in study at James Watt College, Gavin was offered a promotion in his part-time job which meant leaving further education behind. Seventeen years later, having run two £2,000,000 turnover stores and having been the Business Analyst for his firm in both Scotland and Northern Ireland, Gavin wanted to make a real difference to the lives of people living in Renfrewshire.", "Gavin was selected to stand as the SNP candidate in the 2015 Westminster election for the seat of Paisley and Renfrewshire North after securing the support of local party members following an internal selection process. He was elected to the House of Commons in May 2015, overturning the incumbent Labour MP’s 15,280 majority and emerged with a majority of 9,076 votes for himself – representing a 26.47% to Gavin and the SNP locally. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/951/attachments/original/1442436430/Mullin_Roger_MP.jpg?1442436430",
	"page": "https://www.snp.org/roger_mullin",
	"name": "Roger Mullin",
	"constituency": "Kirkcaldy & Cowdenbeath",
	"intro": ["Roger is an Honorary Professor at the University of Stirling where he taught postgraduates Applied Decision Theory, The Political Environment, and Organisation Change. He has undertaken 27 international assignments for the United Nations and governments in many parts of the world.", "He used to write a monthly column for The Times Educational Supplement Scotland, and he also freelanced as an education consultant. He has a wide range of publications to his name in the fields of Decision Making, Education, Leadership and Politics.", "Roger has contested 4 previous General Elections and also was the candidate for the Paisley North by-election in 1990 securing a 14% swing from Labour to the SNP.", "He is a former Vice Convener of the party. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/950/attachments/original/1442436322/Monaghan_Carol_MP.jpg?1442436322",
	"page": "https://www.snp.org/carol_monaghan",
	"name": "Carol Monaghan",
	"constituency": "Glasgow North West",
	"intro": ["Carol was born and brought up in Glasgow North West, graduating from Strathclyde University with a BSc (Hons) in Laser Physics and Optoelectronics in 1993.  She trained as a teacher, gaining a PGCE in Physics and Mathematics.", "Carol has worked in many Glasgow schools, including 14 years at Hyndland Secondary, as Head of Physics and Head of Science.  She spent two years as a Glasgow University lecturer training future teachers.  An SQA consultant, Carol has been involved in developing physics qualifications at a national level.", "A mother of three school-age children, Carol is proud to be part of the changing face of politics and understands that people need elected representatives who appreciate the challenges of daily life."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/949/attachments/original/1442436168/Monaghan_Paul_MP.jpg?1442436168",
	"page": "https://www.snp.org/paul_monaghan",
	"name": "Paul Monaghan",
	"constituency": "Caithness, Sutherland & Easter Ross",
	"intro": ["Dr Paul Monaghan lives in Ross-Shire with Stephanie and his daughter Sian. He was born in Montrose before moving to Inverness with his family when he was 2 years old. For the last 30 years he has lived in Contin.", "Paul was educated at Inverness Royal Academy and at the University of Stirling where he gained a first class honours degree in Psychology and Sociology and a Ph.D. in Social Policy.", "For his first degree he researched and reported on the sources of stress and the coping strategies deployed among the police officers and support staff of Northern Constabulary. For his Ph.D., which he undertook having won a prestigious Collaborative Award in Science and Engineering from the Economic and Social Research Council, he considered the role of Scotland’s largest voluntary organisation in the development and implementation of social policy, in Scotland, during the post-war period. Paul is a Graduate Member of the British Psychological Society and a Fellow of the Institute of Leadership and Management.", "As Director of the Highland Homeless Trust, I led and managed the delivery of specialist housing and social support services to vulnerable people across Highland. This role provided him with first-hand experience of the challenges faced by some of the most marginalised and deprived individuals in Scotland.", "Paul is also very active in supporting a number of other voluntary organisations and partnerships including UHI North Highland College based in Thurso, which he joined in 2007 and where he is Chair of the Audit and Risk Management Committee. Paul also supported the Inverness MS Therapy Centre as a director and in recent years founded two charitable groups.", "The first of these is ‘Food for Families’ based in Invergordon that provides food and basic living supplies to individuals and families that are struggling to make ends meet as a direct consequence of the austerity agenda imposed on the people of Scotland by the UK Government. The second is the ‘North Highland College Foundation’ based in Wick. The Foundation holds cash reserves of £1.25 million and was founded him and two colleagues to facilitate access to further and higher education across Caithness, Sutherland and Easter Ross.", "Paul is a Member of the SSE Fairburn Windfarm Community Fund that distributes funding to local groups, projects and initiatives in and around Ross-Shire.", "Within the Scottish National Party, which he first joined in 1994, Paul holds the positions of Organiser, Wester Ross Branch, and Convener, Highland Council Liaison Committee. He also founded ‘Yes Highland’ that campaigned successfully across Highland for a Yes vote in the referendum held on 18 September 2014. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/948/attachments/original/1442436055/McNally_John_MP.jpg?1442436055",
	"page": "https://www.snp.org/john_mcnally",
	"name": "John McNally",
	"constituency": "Falkirk",
	"intro": ["John McNally is a very popular Councillor as well as one of the most successful local Councillors for the SNP.", "It was in the 2005 Herbertshire by-election, where John McNally, a local Denny Barber, secured Labour’s safest seat with a 24% swing to the SNP, becoming Denny’s first ever SNP Councillor.", "Since then the SNP has topped the poll in the Denny and Banknock Ward in the 2007 and 2011 Scottish Parliamentary Elections and the 2007 and 2012 local elections. ", "It is vital the SNP win the Falkirk Constituency and John McNally who secured over 30% of the vote, up from 21%, in the Falkirk Constituency during the 2010 Westminster Election, a Scottish high swing of 8.9% from Labour to the SNP, has the chance to finish what he started and secure the seat for the SNP. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/947/attachments/original/1442435819/McLaughlin_Ann_MP.jpg?1442435819",
	"page": "https://www.snp.org/anne_mclaughlin",
	"name": "Anne McLaughlin",
	"constituency": "Glasgow North East",
	"intro": ["Anne McLaughlin lives in Dennistoun in the heart of the Glasgow North East constituency where she is MP. She is a former MSP - from 2009 to 2011.", "Anne has gained a reputation as someone who fights tooth and nail for the people who need her help. She has a particular interest in issues around addictions, unemployment, racial equality, mental health and employment rights.", "Anne likes to bring a little creativity into her campaigning and was the originator of the idea to bring in an ice cream van (aka The Ayes Cream Van) as a mobile information shop touring the East End of Glasgow as part of the Yes campaign. She also led the local Yes team to a 57% yes vote in 2014 – the second highest in Scotland. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/945/attachments/original/1494521472/Stuart_McDonald.jpg?1494521472",
	"page": "https://www.snp.org/stuart_mcdonald",
	"name": "Stuart McDonald",
	"constituency": "Cumbernauld, Kilsyth & Kirkintilloch East",
	"intro": ["Stuart McDonald is the Member of Parliament for Cumbernauld, Kilsyth and Kirkintilloch East. He is the SNP Spokesperson on Immigration, Asylum and Border Control and he serves on the Home Affairs Select Committee.", "Stuart grew up in the constituency, in Milton of Campsie, and went to school at Craighead Primary and Kilsyth Academy. He then studied law at Edinburgh University and trained and worked in the legal profession for eight years both in the capital and in Glasgow: first in private practice, then with the NHS and finally in the third sector as a human rights solicitor.", "In 2009, Stuart made the switch into politics taking up research posts with Shirley-Anne Somerville MSP and then Jim Eadie MSP at the Scottish Parliament. This lead on to the role of head of information at Yes Scotland during the referendum campaign. Finally, Stuart worked for the Coalition for Racial Equality and Rights as Parliamentary and Public Affairs Officer.", "Stuart continues to live in his constituency, is an avid football fan and enjoys keeping fit. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/944/attachments/original/1494584477/Stewart_McDonald.jpg?1494584477",
	"page": "https://www.snp.org/stewart_mcdonald",
	"name": "Stewart McDonald",
	"constituency": "Glasgow South",
	"intro": ["Stewart McDonald was born in Castlemilk and still lives in the south side of Glasgow. He has worked in a varied range of jobs, most recently in the constituency office of the local MSP. ", "He was elected as the MP for Glasgow South in May 2015 with a majority of over 12,000. He was a member of the Transport Select Committee. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/943/attachments/original/1494583893/Callum_McCaig.jpg?1494583893",
	"page": "https://www.snp.org/callum_mccaig",
	"name": "Callum McCaig",
	"constituency": "Aberdeen South",
	"intro": ["Callum McCaig was the SNP Group Leader on Aberdeen City Council. He grew up in the city, attending Cults Academy, and has an MA in Politics from Edinburgh University. After graduating he returned to Aberdeen and worked in Sainsbury’s before joining the office of Maureen Watt MSP as her Parliamentary Assistant.", "He was elected to Aberdeen City Council in 2007 representing the Kincorth/Loirston ward. He served in a number of positions in the council administration including Convener of the Licensing Committee and Convener of the Education, Culture and Sport Committee before becoming one of the youngest council leaders in the country in 2011 at the age of 26. Following the local government elections he was elected leader of the opposition group.", "Outside of politics his main interests are travel, football and attempting to learn Spanish. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/942/attachments/original/1494584356/Angus_McNeil.jpg?1494584356",
	"page": "https://www.snp.org/angus_macneil",
	"name": "Angus MacNeil",
	"constituency": "Na H-Eileanan An Iar",
	"intro": ["Angus Brendan MacNeil was born and brought up in Tangasdale, on the Isle of Barra. He was educated at Castlebay School Isle of Barra; The Nicolson Institute, Isle of Lewis, Strathclyde University and Jordanhill, Glasgow.", "After working as a journalist with the BBC, he taught for two years in Salen, Isle of Mull, where he started the Gaelic Medium Unit before moving to Fort William. Angus Brandan lives on the family croft with his wife Jane and their three daughters. He is an active crofter and enjoys fishing and football.", "Angus Brendan MacNeil was elected MP for Na h-Eileanan an Iar in 2005 and he has a high profile throughout his constituency. The main islands in the constituency, which is the length of Wales, include Lewis and Harris, North Uist, Benbecula, South Uist and Barra."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/941/attachments/original/1494585386/Chris_Law.jpg?1494585386",
	"page": "https://www.snp.org/chris_law",
	"name": "Chris Law",
	"constituency": "Dundee West",
	"intro": ["Chris (45) is a Dundee businessman who employs a small team in the financial sector.", "He was a leading Yes campaigner during the referendum and founder of the Spirit of Independence road tour of communities in a refurbished fire engine, which attracted national and international interest.", "He lives in the constituency and has lived in Dundee for more than 30 years.", "Dundee West is a key target seat. Chris Law said: \"It is an honour and a privilege to have been selected to carry the SNP banner in Dundee West, which is a key target seat and I will work hard and take the campaign to every door in the constituency. ", "\"I'm determined to be a strong voice for the people of Dundee West at Westminster.\" "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/940/attachments/original/1442432946/Kerr_Callum_MP.jpg?1442432946",
	"page": "https://www.snp.org/calum_kerr",
	"name": "Calum Kerr",
	"constituency": "Berwickshire, Roxburgh & Selkirk County",
	"intro": ["Calum Kerr is the SNP MP for Berwickshire, Roxburgh and Selkirk and the party's Lead Westminster Spokesperson on the Environment, Food and Rural Affairs. He has established a reputation as an effective parliamentarian and a powerful and passionate campaigner on constituency issues. These include improving transport and communications, boosting the Borders economy and fighting poverty, austerity and welfare cuts.", "Calum is a strong advocate of a better deal for Scotland's farmers and the rural economy, including maximising support from the EU and improving the supply chain to obtain better prices for primary producers.", "Calum's passion for politics found its voice when he became Chair of Yes Scottish Borders in the run-up to the 2014 referendum. A dynamic and tireless organiser, he drove the campaign right across the region, achieving an unprecedented 45 per cent increase in support.", "A history graduate from St Andrews University, Calum was born and raised in the Scottish Borders and lives locally with his wife and three children. Family holidays are enjoyed in the beautiful North West Highlands and hobbies include spending time with friends, rugby and the odd good malt whisky. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/939/attachments/original/1494584728/George_Kerevan.JPG?1494584728",
	"page": "https://www.snp.org/george_kerevan",
	"name": "George Kerevan",
	"constituency": "East Lothian",
	"intro": ["George Kerevan is a journalist, economist and documentary film-maker. He was Associate Editor of The Scotsman newspaper for nine years, and his articles have appeared in The Spectator, New Statesman and Prospect Magazine. George was born in Glasgow in 1949 and went to Glasgow University.", "He lectured in economics at Napier University in Edinburgh where he specialised in energy. He was an elected member of Edinburgh Council for 12 years, in charge of the capital’s economic development. He served on the board of the Edinburgh International Festival, founded the Edinburgh Science Festival and has sat on the boards of many arts organizations including the Traverse Theatre, 7:84 Theatre and the Edinburgh international Film Festival. He is a former chairman of the Edinburgh Tourist Board.", "George has produced documentary programmes for Discovery, History Channel and PBS. He lives with his wife Angela, near Musselburgh. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/938/attachments/original/1494584218/Stewart_Hoise.jpg?1494584218",
	"page": "https://www.snp.org/stewart_hosie",
	"name": "Stewart Hosie",
	"constituency": "Dundee East",
	"intro": ["Stewart is Deputy Westminster Group Leader and Economy Spokesperson.", "Stewart was born in Dundee in 1963. He was educated at Brackens PS, Invertay PS Monifieth, Carnoustie High School, and Bell Street Tech (now Abertay University) where he gained an HD in Computer Studies. Stewart worked in IT / IS for 20 years, and ran his own business. A highly experienced political campaigner, Stewart was the SNP's first Youth Convener and spent four years as the Party's National Secretary before being elected as the Organisation Convener in 2003. Stewart contested the Dundee East Westminster seat in 2001 delivering a 5% swing to the SNP and slashing the Labour majority by 5,500 votes. He has a young daughter, Morag, and lives in the constituency where he was elected as MP for Dundee East on 5 May 2005, taking the seat from Labour."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/937/attachments/original/1494585593/Drew_Hendry.jpg?1494585593",
	"page": "https://www.snp.org/drew_hendry",
	"name": "Drew Hendry",
	"constituency": "Inverness, Nairn, Badenoch & Strathspey",
	"intro": ["Drew Hendry is the MP for Inverness, Nairn, Badenoch & Strathspey. He previously represented the Highland Council ward of Aird and Loch Ness, was Leader of the Highland SNP group, SNP National COSLA Group Leader and the Leader of the Highland Council until elected to serve as MP for the area.", "Drew is a former Director with a multinational appliance manufacturer, having worked his way through a career from shop floor to senior management. He founded Inverness-based Teclan Ltd, the first private sector company in Inverness to commit to paying all staff the Living Wage. He is married to Jackie and has four children.", "Just some of the priorities delivered under Drew:", " "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/936/attachments/original/1442348006/Gray_Neil_MP.jpg?1442348006",
	"page": "https://www.snp.org/neil_gray",
	"name": "Neil Gray",
	"constituency": "Airdrie & Shotts",
	"intro": ["Neil was elected as the MP for Airdrie & Shotts in May 2015 with a majority of 8779. He currently sits on the House of Commons Finance Committee, the Joint Committee on the Restoration of the Palace of Westminster and is the SNP Spokesperson for Fair Work and Employment. Neil is a member of the SNP Westminster Social Justice team, led by Eilidh Whiteford MP, and is Secretary to the APPG on Poverty.", "Neil was born and brought up in the Orkney Isles. He moved to the central belt when attending Stirling University from 2004, where he gained a first class degree in Politics and Journalism.", "Neil worked as journalist for the BBC and local newspaper titles before moving to the SNP’s press and research office in Holyrood.", "Neil was employed by Alex Neil MSP in his constituency office in August 2008 and became his office manager in 2011.", "Outside of politics Neil was a keen athlete – representing Scotland at 400m – until a serious knee injury ended his career. More recently Neil has run long distance events – completing an ultra marathon in 2013.", "Neil is married with a baby daughter. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/935/attachments/original/1495018756/PeterGrant.png?1495018756",
	"page": "https://www.snp.org/peter_grant",
	"name": "Peter Grant",
	"constituency": "Glenrothes",
	"intro": ["Peter’s constituency stretches from Cardenden to central Leven, with Glenrothes and Levenmouth being its two largest population centres.  He was elected to Parliament in 2015, achieving a swing of 35% from Labour to the SNP.", "Peter was brought up in Lanarkshire and moved to Glenrothes in 1983.  He worked as a teacher before retraining as an accountant with the NHS in Fife, and subsequently worked in a variety of finance related jobs in public sector and charitable organisations.", "Peter served as a councillor in Glenrothes from 1992 until 2015. He was leader of Fife Council between 2007 and 2012.", "In the last Parliament Peter was a member of the SNP’s International Affairs team and served on parliament’s European Scrutiny Committee and the Select Committee on Brexit.", "Supported by his constituency staff Peter gained a reputation as a hard working local MP.  He has championed the work of a number of local organisations who provide help to constituents living with the impact of UK austerity cuts.  In the last year his team have helped to recover over £93,000 for constituents whose benefits or tax credits had been wrongly assessed by the DWP.", "Peter lives in Glenrothes and has been married for nearly 33 years to Fiona, a local GP and Councillor.", " "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/934/attachments/original/1494585919/Patrick_Grady.jpg?1494585919",
	"page": "https://www.snp.org/patrick_grady",
	"name": "Patrick Grady",
	"constituency": "Glasgow North",
	"intro": ["Patrick joined the SNP in 1997, aged 17. Originally from Inverness, he has made Glasgow his home since moving there as a student, with spells living and working in London and Malawi.", "He has a strong personal and professional interest in international development issues, and has worked in a range of policy and campaigning positions in the charity and public sector. He is now the SNP Westminster Group Spokesperson on International Development.", "He has held a number of SNP responsibilities, and has been National Secretary of the Party since 2012. He was elected MP for Glasgow North in the 2015 General Election."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/933/attachments/original/1442347548/Gibson_Patricia_MP.jpg?1442347548",
	"page": "https://www.snp.org/patricia_gibson",
	"name": "Patricia Gibson",
	"constituency": "North Ayrshire & Arran",
	"intro": ["Patricia was born and educated in Glasgow, gaining a BA (Hons) in English and Politics from the University of Glasgow.", "She taught English for over 20 years in Glasgow, Lanarkshire and East Renfrewshire and for five years served as SNP Education Spokesperson on Glasgow City Council, representing Glasgow Pollok Ward as a councillor for five years from 2007 to 2012.", "Patricia first contested North Ayrshire & Arran in 2010, helping to make it the SNP’s fourth most winnable seat in 2015, albeit with a still huge majority to overcome, which she did, with a 23.3% swing, securing a 13,573 majority over the Labour incumbent.", "Patricia lives in her constituency, in Kilbirnie. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/932/attachments/original/1494586083/Stephen_Gethins.jpg?1494586083",
	"page": "https://www.snp.org/stephen_gethins",
	"name": "Stephen Gethins ",
	"constituency": "North East Fife",
	"intro": ["Stephen Gethins has worked across the political and NGO sectors. He holds a Law Degree from the University of Dundee where he focused on Public International Law and also studied at the University of Antwerp. He also holds a Research Masters from the University of Kent on the role that devolved assemblies have to play in the resolution and prevention of inter-ethnic conflict.", "Stephen has enjoyed an illustrious career in the political and international NGO sector. He has worked in peace-building, arms control and democratisation in the Caucasus and Balkans. He worked with the NGO Links, based in Tbilisi, with a focus on the conflicts surrounding the breakaway entities in the South Caucasus such as South Ossetia, Abkhazia and Nagorno-Karabakh. He worked for Saferworld on arms control and peace-building in the former Soviet Union and Balkans. He has also been involved in a range of democratisation projects across the former Soviet Union and Western Balkans.", "Stephen was until recently a Special Adviser to Scotland’s First Minister, advising on European and International Affairs as well as Rural Affairs, Energy and Climate Change. He was also a Political Advisor with the Committee of the Regions in the European Union, a position which saw him working with local authorities from across Europe. He also worked at Scotland Europa, helping Scottish organisations gain influence and funding in the EU.", "In 2011, as part of a select number of other European participants, Stephen was involved in the US Government’s International Visitor Leadership Programme which analysed 'US Foreign Policy Challenges'. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/931/attachments/original/1442347277/Ferrier_Margaret_MP.jpg?1442347277",
	"page": "https://www.snp.org/margaret_ferrier",
	"name": "Margaret Ferrier",
	"constituency": "Rutherglen & Hamilton West",
	"intro": ["Margaret lives in Halfway, South Lanarkshire with her 22-year-old daughter Caitlin, who has recently qualified as a primary school teacher.", "Prior to her election as the MP for Rutherglen and Hamilton West, Margaret worked as a Sales Manager for a blue chip manufacturing construction company in Motherwell.", "Margaret was born and bred in Glasgow, moved to Rutherglen in 1972-1990 and has lived in Cambuslang for 15 years. She was an elected community councillor within Halfway and as a member of both Amnesty International and Scottish CND has always been a fierce advocate of human rights, social justice, and nuclear disarmament.", "She has worked as a volunteer for the Citizens Advice Bureau giving her an insight into how invaluable a service the CAB delivers for many people who have no other route to go down and are desperate for advice.", "Since her election, Margaret has been incredibly active at Westminster. In addition to taking part in debates and business in the chamber, she received widespread praise for securing an important debate on the transportation of nuclear warheads, and is one of the named sponsors on the Food Waste (Reduction) Bill.", "Margaret is the SNP Spokesperson on the Scotland Office and a Member of Scottish Affairs Committee at Westminster. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/930/attachments/original/1494586161/Marion_Fellows.jpg?1494586161",
	"page": "https://www.snp.org/marion_fellows",
	"name": "Marion Fellows",
	"constituency": "Motherwell & Wishaw",
	"intro": ["Marion Fellows studied Accountancy and Finance at Heriot Watt University and spent her early career in a variety of related roles in both the public and private sectors. She subsequently taught in further education, spending 19 years teaching business studies at West Lothian College, where she was an active and senior member of the EIS Trade Union.", "She has lived with her family in Wishaw and Bellshill for 40 years, and has represented Wishaw as a local SNP councillor since 2012. She was a senior figure in the Yes Motherwell and Wishaw campaign, which won a majority locally in the 2014 Independence Referendum. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/929/attachments/original/1442346967/Donaldson_Stuart_MP.jpg?1442346967",
	"page": "https://www.snp.org/stuart_donaldson",
	"name": "Stuart Donaldson",
	"constituency": "West Aberdeenshire & Kincardine",
	"intro": ["Stuart Donaldson grew up in the constituency and was educated at Durris Primary School and Banchory Academy before studying at the University of Glasgow.", "Living and working in the North East he has gained an in-depth knowledge on local issues including farming, oil & gas, and tourism.", "Stuart makes the best of the fantastic amenities in the constituency and can often be seen running or walking in the spectacular countryside in the North East. Stuart is also attempting to lean to play golf and hopes to play some of the world class courses in West Aberdeenshire when his skills improve.", "Stuart is part of the International Affairs team at Westminster and has a keen interest in languages, particularly Mandarin. Stuart gained the Westminster seat of West Aberdeenshire and Kincardine in May 2015."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/928/attachments/original/1442346000/Docherty_Martin_MP.jpg?1442346000",
	"page": "https://www.snp.org/martin_docherty",
	"name": "Martin Docherty",
	"constituency": "West Dunbartonshire",
	"intro": ["Born in 1971 and raised in Clydebank, and working from the age of 16 Martin joined the SNP in 1991 being elected as Scotland's youngest Councillor to the then Clydebank District Council in 1992 at the age of 21.", "Martin eventually returned to education graduating from GCFT now Glasgow Met with a HND in Business Administration in 1997, earning his Politics degree from University of Essex and in 2004, then attended the Glasgow School of Art to undertake his Masters Degree.", "On finishing his studies Martin came home to Clydebank and has spent over a decade working for West Dunbartonshire Community and Volunteering Services (WDCVS), supporting and developing West Dunbartonshire’s community and volunteering organisations.", "From sourcing community funding to delivering training and volunteering opportunities Martin’s work in West Dunbartonshire has given him first­hand knowledge of the issues facing the community he comes from and has worked in most of his adult life. In 2014 Martin joined the national body for volunteering, Volunteer Scotland as the National Policy Advisor.", "Martin continued to be involved in the front­line of politics returning to local government as a SNP Councillor to Glasgow City Council in 2012 till his election to the U.K. Parliament in May 2015.", "Martin is the SNP NATO Parliamentary Assembly Delegate. Martin is the Vice Chair of the following All Parliamentary Party Groups: Civil Society and Volunteering and Irish In Britain.", "Martin lives with his partner and two whippets in Whiteinch. "],
	"contacts": {
		"email": "campaign@martindocherty.scot"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/912/attachments/original/1442345816/Day_Martyn_MP.jpg?1442345816",
	"page": "https://www.snp.org/martyn_day",
	"name": "Martyn Day",
	"constituency": "Linlithgow & East Falkirk",
	"intro": ["Martyn Day is the SNP Member of Parliament for Linlithgow and East Falkirk, and is a passionate community activist.", "Having been a local councillor in West Lothian for 16 years and a dedicated SNP activist campaigning for independence across the constituency for many years, Martyn is well known across the communities he represents and is trusted to deliver for local people. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/910/attachments/original/1442345657/Crawley_Angela_MP.jpg?1442345657",
	"page": "https://www.snp.org/angela_crawley",
	"name": "Angela Crawley",
	"constituency": "Lanark & Hamilton East",
	"intro": ["Angela Crawley was elected as the SNP MP for Lanark and Hamilton East in May 2015. Prior to her election to Parliament, she served as an SNP Councillor for Hamilton South in South Lanarkshire.", "Angela is the SNP’s Spokesperson for Equalities, Women and Children and sits on the Women and Equalities committee in Westminster.", "Born and raised in Hamilton, Angela attended John Ogilvie High School before going on to study Politics at Stirling University. Having obtained a B.A honours degree in Politics, she continued to invest in her education and completed her LLB in Law from the University of Glasgow.", "She also worked as a Parliamentary Assistant for a Government Minister and a Member of the Scottish Parliament. ", " "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/909/attachments/original/1442345525/Cowan_Ronnie_MP.jpg?1442345525",
	"page": "https://www.snp.org/ronnie_cowan",
	"name": "Ronnie Cowan",
	"constituency": "Inverclyde",
	"intro": ["Greenock is where I belong, where I currently live and where I campaign.", "My fore­fathers were Clydeside joiners, mill­workers and weavers. The exception was my father who was a distinguished goalkeeper for Morton and Scotland. I attended school in Inverclyde and my 3 children have grown up in the area. From Port Glasgow to the outlying villages, I know this area well and understand its needs.", "The SNP has been my party since the age of 16. My proudest political achievement to date has been my leadership of YES Inverclyde, a campaign which, against the odds, came within 86 votes of delivering a Yes vote in a unionist stronghold.", "I have been running my own IT company for the last twelve years and have a lifetime's experience in this field. I have worked with major companies all over the UK and Ireland, giving me a perspective on how Inverclyde performs in comparison to other places. I am accustomed to working as part of a team and providing leadership.", "Together with my political experience, I am exactly at the right stage of my life to serve as an MP. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/908/attachments/original/1490261916/JC.jpeg?1490261916",
	"page": "https://www.snp.org/joanna_cherry",
	"name": "Joanna Cherry",
	"constituency": "Edinburgh South West",
	"intro": ["Joanna Cherry QC has been in practice as an Advocate for about 20 years. She became a QC in 2009 and is ranked by the Legal 500 as one of the leading QCs in Scotland. She previously held the offices of Standing Junior Counsel to the Scottish Government and Advocate Depute and she was one of the first specialist sex crimes prosecutors in the Crown Office’s pioneering National Sex Crimes Unit. She has appeared at the UK Supreme Court on a number of occasions, including twice on behalf of the Lord Advocate.", "She recently co-authored the textbook “Mental Health and Scots Law in Practice’ (2nd edition).", "Joanna has been a member of the SNP since 2008 and is a long term supporter of independence and home rule. During the Referendum she co-founded and led “Lawyers for Yes”, a group of around 200 lawyers who had a high profile during the campaign. "],
	"contacts": {
		"facebook": "JoannaCherryMP/",
		"twitter": "joannaccherry"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/907/attachments/original/1442345204/Chapman_Douglas_MP.jpg?1442345204",
	"page": "https://www.snp.org/douglas_chapman",
	"name": "Douglas Chapman",
	"constituency": "Dunfermline & West Fife",
	"intro": ["I have lived in Dunfermline for over 23 years. My wife works in a primary school in Cowdenbeath and both my children have gone to school in Dunfermline. This is our home and I am very proud of the area. It would a huge honour to represent the people of this wee bit of Scotland at Westminster.", "I had a working life for some 26 years before I got involved in politics. Most of that time was with TSB Scotland in branch banking and latterly in personnel management. ", " ", " "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/906/attachments/original/1494586893/Lisa_Cameron.jpg?1494586893",
	"page": "https://www.snp.org/lisa_cameron",
	"name": "Lisa Cameron",
	"constituency": "East Kilbride, Strathaven & Lesmahagow",
	"intro": ["Dr Lisa Cameron is an NHS Consultant working with clients who have mental health problems and learning difficulties. She graduated from Strathclyde and Glasgow Universities and has experience in treatment, training, risk assessment and health research.", "Lisa grew up in the Westwood area of East Kilbride where she went to school. Since qualifying she has served the public at Hairmyres Hospital, Wishaw General Hospital, Dykebar Hospital and the State Hospital. She is an Expert Witness within the Scottish Court system working in cases of childhood sexual abuse and domestic violence.", "Lisa has been an active local Union Representative over the past twelve years, campaigning for worker’s rights, pay, pensions and issues of discrimination and equality.", "Lisa lives in South Lanarkshire with her husband Mark and two daughters Olivia and Charlotte. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/905/attachments/original/1442344742/Brown_Alan_MP.jpg?1442344742",
	"page": "https://www.snp.org/alan_brown",
	"name": "Alan Brown",
	"constituency": "Kilmarnock & Loudoun",
	"intro": ["I am 44 years old, married and have two teenage sons. I have stayed in the constituency my entire life, attending the local primary school and subsequently Loudoun Academy. From there I attended Glasgow University, graduating with an Honours degree in Civil Engineering. I have worked in this sector for 21 years, both in the private and public sector and am currently employed as a Principal Engineer.", "I have been an elected councillor, since 2007. I have had various roles within the council including Spokesperson for Planning and am now a member of the cabinet, and chair of the Grants Committee. I currently have spokespersons roles for Housing, and Strategic Planning and Resources as well as several trustee / director roles – Kilmarnock Leisure Centre, East Ayrshire Council, Galston Development Partnership, Irvine Valley Regeneration Partnership and Newmilns Snow and Sports Complex.", "My hobbies include attending Kilmarnock FC matches, walking, camping, cooking."],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/904/attachments/original/1494587104/Deidrie_Brock.jpg?1494587104",
	"page": "https://www.snp.org/deidre_brock",
	"name": "Deidre Brock",
	"constituency": "Edinburgh North & Leith",
	"intro": [],
	"contacts": {
		"website": "http://www.dbrockmp.scot/%20"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/903/attachments/original/1442344421/Boswell_Phil_MP.jpg?1442344421",
	"page": "https://www.snp.org/phil_boswell",
	"name": "Phil Boswell",
	"constituency": "Coatbridge, Chryston & Bellshill",
	"intro": ["Philip Boswell was born and raised in Coatbridge and is married with three children.  His work as a quantity surveyor and contracts engineer in the oil industry has given him a clear perspective on how Scotland is performing compared to other oil rich countries.  He believes that Westminster is not serving the best interests of either Scotland or Coatbridge, Chryston and Bellshill. ", " ", " "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/902/attachments/original/1442344334/Blackman_Kirsty_MP.jpg?1442344334",
	"page": "https://www.snp.org/kirsty_blackman",
	"name": "Kirsty Blackman",
	"constituency": "Aberdeen North",
	"intro": ["In 2015, Kirsty Blackman became the UK Parliament member for the Aberdeen North Constituency having been elected to parliament with an impressive 56.4% of the vote. ", "Kirsty is the SNP Spokesperson on the House of Lords and is interested in a range of constitutional topics. She is also a member of the SNP’s Economy team and has led for the SNP on parts of the annual Finance Bill.  Kirsty has regularly stressed the need for the UK Government to recognise the effect the oil price fall has had on Aberdeen and so provide more support to the oil and gas sector to secure more jobs now and in the future. ", "In Aberdeen, Kirsty has met with hundreds of constituents and organisations and has tried hard to be as accessible as possible. Her office on John Street is busy as Kirsty and her staff have worked hard to publicise the help they can offer.  ", "In 2016, Kirsty won Patchwork Foundation’s SNP Newcomer of the year award, recognising her work in engaging with communities that have traditionally been hard for politicians to reach. Kirsty does all she can to encourage young people and those from communities who are underrepresented in elected politics to get involved.", " "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/901/attachments/original/1442344228/Blackford_Ian_MP.jpg?1442344228",
	"page": "https://www.snp.org/ian_blackford",
	"name": "Ian Blackford",
	"constituency": "Ross, Skye & Lochaber",
	"intro": ["Ian Blackford lives on Isle of Skye with his wife Ann where they own and run a croft. Their children have all entered adult hood and have left home. Ian has a long history of working in the financial sector working with businesses in Scotland and Europe. ", "Since his Election to Westminster Ian has been appointed as the SNP spokesperson on Pensions.", "Ian was born in Edinburgh, he first joined the SNP in the late 70s. Ian has held a variety of positons in the SNP including membership of the National Executive Committee.", "As a keen football supporter Ian is frequently seen at Easter Road supporting Hibernian FC, he also travels extensively as a fan of the national football team."],
	"contacts": {
		"email": "http://www.facebook.com/IanBlackford.SNP",
		"twitter": "IBlackfordSNPMP",
		"facebook": "IanBlackford.SNP/",
		"website": "http://www.ianblackford.com"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/900/attachments/original/1494587628/Mhairi_black.jpg?1494587628",
	"page": "https://www.snp.org/mhairi_black",
	"name": "Mhairi Black",
	"constituency": "Paisley & Renfrewshire South",
	"intro": ["In 2011 I joined the SNP after hearing there would be a referendum on Scottish independence.", "From this, I began to regularly stand on Paisley High Street handing out leaflets for the Yes campaign. Slowly I began to build more confidence and began to canvass and chap people’s doors. As time went on and momentum began to build I found that there was a desire everywhere you looked for more knowledge. I began to attend more public meetings and devote more and more time to the campaign."],
	"contacts": {
		"facebook": "Mhairi.Black.SNP/",
		"twitter": "MhairiBlack"
	}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/899/attachments/original/1494587364/Hannah_Bardell.jpg?1494587364",
	"page": "https://www.snp.org/hannah_bardell",
	"name": "Hannah Bardell",
	"constituency": "Livingston",
	"intro": ["Hannah was born and brought up in Craigshill, Livingston and attended Broxburn Academy and the University of Stirling. She started her career in commercial television with STV Glasgow and GMTV London latterly as the Assistant Producer on their Political 'Sunday Programme'.", "Hannah then worked with the SNP as part of their 2007 central campaign team producing and presenting SNPtv online. For the next 3 years Hannah managed Alex Salmond's constituency office working for him as an MSP and MP and working for Ian Hudghton MEP.", "Hannah then moved on to work for the U.S. State Dept in their Edinburgh Consulate managing protocol, events and press.", "For the last 3 years Hannah has been working in the Oil & Gas sector initially with Subsea 7 and for the last 2 years as Head of Communications & Marketing for the UK, Africa & Norway with Oil & Gas Service company Stork.", "Hannah has been a member of the Grampian Chamber of Commerce Policy Committee, Business for Scotland and sits on the Aberdeen Performing Arts development committee for the refurbishment of their Music Hall.", "In her teenage years Hannah was a Pushkin Prize winner for creative writing which took her to St Petersburg, Russia.", "In her spare time Hannah enjoys playing guitar and singing, creative writing, the arts and musical theatre. She is also a great lover of the Scottish outdoors and enjoys surfing, golfing, watching most sports but in particular football and rugby. ", ""],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/898/attachments/original/1442343774/Arkless_Richard_MP.jpg?1442343774",
	"page": "https://www.snp.org/richard_arkless",
	"name": "Richard Arkless",
	"constituency": "Dumfries & Galloway",
	"intro": ["Richard was born in Stranraer in 1975 then raised in East London before his family returned and bought a small hotel, which they renamed the 'Arkhouse Inn'.", "He was first in his family to go to University and studied Financial Services at Glasgow Caledonian University, followed by an LLB Law at Strathclyde and the Diploma in Legal Practice. After qualifying he worked as a solicitor in Consumer litigation in Cheshire. He continued to work for the firm when he returned to Stranraer.", "In 2013, he postponed his legal career to set up a small business which operates on­line from Stranraer, where he still lives with his wife and 2 young kids. "],
	"contacts": {}
}, {
	"image": "https://d3n8a8pro7vhmx.cloudfront.net/thesnp/pages/911/attachments/original/1442343666/Ahmed-Sheikh_Tasmina_MP.jpg?1442343666",
	"page": "https://www.snp.org/tasmina_ahmed-sheikh_mp",
	"name": "Tasmina Ahmed-Sheikh",
	"constituency": "Ochil & South Perthshire",
	"intro": ["Tasmina Ahmed-Sheikh is the Member of Parliament for Ochil and South Perthshire, the SNP Westminster Spokesperson for Trade and Investment and Deputy Shadow Leader of the House. She is also National Women's and Equalities Officer for the SNP.  Tasmina is a leading Scottish businesswoman, lawyer, screen actress and mother-of-four.", "Prior to her election in May 2015, she was a senior business and legal practice executive, with extensive and consistent track record of working with national and international clients. She developed specific experience in providing legal support via the Islamic Bank of Britain and United National Bank in Sharia law and Islamic Financial Products, and had a strong involvement in the provision of legal support to historically challenged demographic groups, including Black and Minority Ethnic Communities and Women, and in the provision of advice in Immigration & Human Rights law. ", "She was a Board Member and Chair of the International and Commercial Development Committee of the City of Glasgow College from 2011 until her election, and an Advisory Board member for Yes Scotland, which campaigned in the 2014 Referendum to present the commercial, economic, social and political business case for an independent Scotland. She sits on the Board of a number of Scottish charities.  "],
	"contacts": {}
}]